{
    "name": "Premonition",
    "type": "spell",
    "img": "icons/magic/time/hourglass-brown-orange.webp",
    "system": {
        "description": {
            "value": "<p>You weave an incantation that gives one creature a short glimpse into what effect their actions may have. As a reaction you can target one creature within range that is beginning its turn, imbuing it with a mystical vision of foresight. The target carries out its turn as normal, but players should make careful note of any changes to the hit points and other resources of creatures during the turn. At the end of its turn, the target must choose to either accept the outcome of its actions or to avert this possible fate. If the creature is unable to make this choice due to being dead or @Compendium[undertaking.conditions.9KB959MRZ0H4IT4C]{Unconscious}, the outcome is automatically averted.</p><p>If the target accepts the outcome, the turn order progresses as normal. If the target chooses to avert this outcome, all actions taken by any creature since the start the target&rsquo;s turn are undone, and any resources expended are regained. The target experiences this undone turn as a vision of what might have been. From all other perspectives, the undone turn never happened. The target can take its turn again from the beginning, unbound by the choices and dice results of its previous attempt.</p><p>A creature can only alter its fate with this spell once per round. If an effect would increase the duration of this spell, the premonition doesn&rsquo;t happen until the target creature chooses to activate it at the start of their turn while the spell is active. Once the creature chooses to activate the premonition, the spell will end at the end of the creature&rsquo;s turn regardless of whether they chose to alter their fate with it or not.</p><p>The tenuous window of time provided by this spell reacts poorly with other forms of divination. Whenever a creature under the effects of this spell casts a Divination spell of 1st level or higher, this spell immediately ends and they lose their ability to alter their fate this turn.</p><p>If you cast this spell in a situation where time is not being tracked in turns, then the foresight it confers lasts about 6 seconds. For example, this would be enough time to foresee the outcome of one brief skill check or the response to one statement in a conversation.</p>",
            "chat": "",
            "unidentified": ""
        },
        "source": "Core Rules",
        "level": "4",
        "charge": false,
        "school": "div",
        "components": {
            "somatic": true,
            "verbal": true,
            "material": false,
            "ritual": false,
            "concentration": false
        },
        "materials": {
            "value": "",
            "consumed": false,
            "cost": "",
            "supply": 0
        },
        "attribute": "spell",
        "actionType": "util",
        "activation": {
            "type": "reaction",
            "cost": "1",
            "condition": ""
        },
        "duration": {
            "value": "1",
            "units": "round"
        },
        "range": {
            "value": "30",
            "long": null,
            "units": "ft"
        },
        "target": {
            "value": "1",
            "width": null,
            "units": "",
            "type": "creature"
        },
        "damage": {
            "parts": [],
            "versatile": ""
        },
        "save": {
            "attribute": "",
            "dc": null,
            "scaling": "spell"
        },
        "showInAttacks": false
    },
    "_id": "05GSPZ2EJSXDRGRB"
}