{
  "name": "Seasons of Faith",
  "type": "ability",
  "img": "icons/magic/nature/plant-sproud-hands-dirt-green.webp",
  "system": {
    "description": {
      "value": "<p>The seasons serve as a powerful example of how life can endure and even thrive amid changing circumstances, a lesson you choose to emulate with your faith.<br />&nbsp;&nbsp;&nbsp;&nbsp;You gain the following unassigned Mantras associated with your <strong>Eikonic Number of Nature</strong>, and you may replace one of your assigned Mantras with one of these new ones. Each time you activate <strong>Faith Abides</strong>, you can choose one of these Mantras to also occur. The Mantras are:</p><ul><li><strong>Spring&rsquo;s Sprawl:</strong> Thorny bushes with flowers appear in a 10ft square centered on a point you can see within 30ft of you. Any creature that enters a space with a thorn bush takes 1d4 piercing damage. Thorns in a space are destroyed automatically when attacked directly or if the space is subjected to any fire damage.</li><li><strong>Summer&rsquo;s Glow:</strong> A swarm of fireflies appear around you and fly any distance up to 30ft in a direction of your choosing. The fireflies shed dim light in a 5ft radius and remain in place once they reach their destination or can&rsquo;t move any further. The fireflies scatter after 1 minute.</li><li><strong>Autumn&rsquo;s Canvas:</strong> A 5ft-tall juvenile tree adorned with autumn leaves emerges in an unoccupied space you can see within 30ft of you. Creatures can move through the tree&rsquo;s space normally. The tree is too weak to support anything larger than a Tiny creature attempting to climb it, but it can provide Half Cover to Medium or smaller creatures obscured by it. At the end of your next turn, all of the leaves fall from the tree and it is no longer suitable for use as cover.</li><li><strong>Winter&rsquo;s Blanket: </strong>A 15ft square within 30ft of you is blanketed with snow and becomes difficult terrain. The snow melts at the end of your next turn or when its space is subjected to any fire damage.</li></ul>",
      "chat": "",
      "unidentified": ""
    },
    "source": "Core Rules",
    "type": {
      "value": "class",
      "subtype": "subclass"
    },
    "requirements": "Natural Dominion",
    "recharge": {
      "value": null,
      "charged": false
    }
  },
  "folder": null,
  "_id": "ES1J6R9RFQJ33HVU"
}
