{
  "name": "Miracle: Spirit Animal",
  "type": "ability",
  "img": "icons/creatures/mammals/spirit-deer-herd-blue.webp",
  "system": {
    "description": {
      "value": "<p>When you learn this ability, the following Miracle is added to your list of options available when a Miracle is triggered.<ul><li><b>Custodia Naturalis:</b> You summon a Spirit Animal in an unoccupied space within 15 feet of you, choosing its form to be a Bear, Eagle, Panther, or Wolf. The statistics for the creature are detailed later in this ability. The Spirit Animal acts immediately after your turns in combat and follows your commands. It lasts until you complete a long rest or it drops to 0 hit points. If you activate this miracle while you already have a Spirit Animal summoned, you can replace its form with another from the list, restore all of its hit points, and make it reappear in an unoccupied space within 15 feet of you.</li></ul></p><br><br><h3>Spirit Animal</h3><p>Medium Celestial (Small Celestial in Eagle Form)</p><p>AC 14</p><p>Hit Points 5 + 5 times your Cleric Level</p><p>Speed 40ft, climb 30ft</p><table><tbody><tr><td><p>STR</p></td><td><p>DEX</p></td><td><p>CON</p></td><td><p>INT</p></td><td><p>WIS</p></td><td><p>PRE</p></td></tr><tr><td><p>16 (+3)</p></td><td><p>16 (+3)</p></td><td><p>16 (+3)</p></td><td><p>3 (-4)</p></td><td><p>14 (+2)</p></td><td><p>7 (-2)</p></td></tr></tbody></table><p>Skills: Instinct +4, Perception +4, Stealth + 5</p><p>Awareness: 14</p><p>Challenge: &ndash;-</p><p><strong>Eagle Form.</strong> In Eagle Form, the Spirit Animal loses its climbing speed and half of its move speed, and gains a flying speed of 60 ft.</p><p><strong>Bear Form.</strong> In Bear Form, the Spirit Animal has resistance to bludgeoning, slashing, and piercing damage.</p><p><strong>Wolf Form.</strong> In Wolf Form, the Spirit Animal has advantage on attacks if one or more of its allies are within 5 feet of the target.</p><p><strong>Panther Form.</strong> In Panther Form, the Spirit Animal can hide as a minor action.</p><p><strong>Actions</strong></p><p><strong>Claws.</strong> Melee Weapon Attack: +5 to hit, reach 5 ft, one target. Hit: Deal 1d4+3 slashing damage.</p><p><strong>Bite.</strong> Melee Weapon Attack: +5 to hit, reach 5 ft, one target. Hit: Deal 1d8+3 piercing damage.</p><p><strong>Multiattack. </strong>The Spirit Animal makes one attack with its Bite and one with its Claws.</p><p><strong>Pounce (Panther Form only).</strong> The Spirit Animal makes one attack with its bite. If it was hidden from its target, the attack deals an additional 2d8 damage on a hit.</p>",
      "chat": "",
      "unidentified": ""
    },
    "source": "Core Rules",
    "type": {
      "value": "class",
      "subtype": "subclass"
    },
    "requirements": "Natural Dominion",
    "recharge": {
      "value": null,
      "charged": false
    }
  },
  "folder": null,
  "_id": "1YD5VVREY3QRIR5L"
}
