{
  "name": "Core Lep'ix",
  "type": "race",
  "img": "icons/environment/creatures/bug-tick-red.webp",
  "system": {
    "description": {
      "value": "<p>Lep'ix are bipedal, insectoid vertebrates with a smooth, generally grey, exoskeleton. Though they are shorter on average than humans and chk'tu, their frame is generally more lithe and their figure is accented by the presence of large butterfly or moth-like wings. Lep'ix also possess a single pair of large, round eyes as well as a pair of bent, fern-like antennae. Often, they will also have a thick mane of filaments resembling fur around the neck, trailing off to a less thick covering along the head and shoulders.<br>&nbsp;&nbsp;&nbsp;&nbsp;The wings of no two Lep'ix are alike in shape or pattern, and some communities of Lep'ix are imbued with various forms of otherworldly magic which further differentiates the kinds of mesmerizing patterns that can be found upon them.</p>",
      "chat": "",
      "unidentified": ""
    },
    "source": "Core Rules",
    "portion": "core",
    "classDetails": "<p>Core Lep'ix Traits</p><ul><li><b>Compatibility: </b>Insectoid</li><li><b>Attribute Increase: </b>Your Presence increases by 1.</li><li><b>Lifespan: </b>Lep'ix reach maturity around 5 years old and live to 50 or 60 years on average.</li><li><b>Size: </b>Medium; Lep'ix are generally between 4 to 5 feet tall, and weigh between 70 to 140 pounds.</li><li><b>Speed: </b>Your base ground speed is 30 feet.</li><li><b>Flutter Fall: </b>@Compendium[undertaking.abilities.XQVA2ZE3HFJHJ8Z4]{Flutter Fall}</li><li><b>Captivating Patterns:</b> Your wings are a tapestry of mesmerizing patterns. You know the @Compendium[undertaking-homebrew.spells-cantrips.S19PI54SQR9C8R14]{Captivate} cantrip. Intelligence, Wisdom, or Presence is your spellcasting attribute for it (chosen when you select this race).</b></li><li><b>Delicate Wings: </b>Your Constitution score decreases by 1. If your branch race grants you the Flutter Fall ability again or a flying speed, ignore this penalty.</li><li><b>Weak Build: </b>@Compendium[undertaking-homebrew.abilities.5FAD194X1HDZFU2U]{Weak Build}</li><li><b>Insectoid Creature: </b>@Compendium[undertaking.abilities.2ZY5QMOZSWWLGX2V]{Insectoid Creature}</li><li><b>Languages: </b>You can speak, read, and write Common and Chitter.</li></ul>"
  },
  "effects": [],
  "folder": null,
  "sort": 0,
  "ownership": {
    "default": 0
  },
  "flags": {},
  "_id": "ZXRXCHIPV04IUNZ2"
}
